app/Http/Controllers/Auth/LoginController.php

    public function handleProviderCallback($provider)
    {
            $socialUser = Socialite::driver($provider)->user();
            //dd(Socialite::driver($provider)->user());
         //Tìm hoặc tạo người dùng mới
        $user = User::firstOrCreate([
            'email' => $socialUser->getEmail(),
        ], [
            'name' => $socialUser->getName(),
            'provider' => 'google',
            'provider_id' => $socialUser->getId(),
            'avatar' => $socialUser->getAvatar(),
            'password' => Hash::make(Str::password(24)),
        ]);
---
select * from `users` where (`email` = 'nhocway996@gmail.com') limit 1