app/Http/Controllers/Auth/RegisterController.php

insert into `users` (`name`, `email`, `password`, `updated_at`, `created_at`) values ('nguyen dat', 'ntd1753@gmail.com', '$2y$10$ESSwnpEU06LvmnnYoXrm..EiYC9NT49l2LNwALDtq7TxU1JeBcfOy', '2024-05-13 02:50:36', '2024-05-13 02:50:36')
---
    protected function create(array $data)
    {
        return User::create([
            'name' => $data['name'],
            'email' => $data['email'],
            'password' => Hash::make($data['password']),
        ]);